Revit 2027 API
StairsRunType.IsMonolithic Property
 True if the stairs run is monolithic, false otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMonolithic { get; }
Public ReadOnly Property IsMonolithic As Boolean
	Get
public:
property bool IsMonolithic {
	bool get ();
}
member IsMonolithic : bool with get
Property Value
Boolean
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace